Repository: IvanKarpov-1/CJTasksHelperBot
Catalog: src/CJTasksHelperBot.Infrastructure/Resources/Messages.*.resx
Languages: uk

# help_message
source: Hello, I am <b>CJTasksHelperBot</b>. I will help you organize your tasks and homework. Some commands are executed in several steps, so you need to keep entering the necessary information or cancel the command. Some commands support command line arguments with flags. For details, add the <code>-h|--help</code> flag to the command (separated by a space). This flag takes precedence over other flags, so others will be ignored. To interact with me, use the following commands: /start — show available commands /help — show this help /get_current_user — show the name of the current user /add_task — add a task /get_tasks — view tasks /ch_lang — change the display language for the chat /update_status — update task status /stop — stop the current command
uk: Привіт! Я — <b>CJTasksHelperBot</b>. Я допоможу організувати ваші задачі та домашні завдання. Деякі команди виконуються в декілька кроків, тому потрібно не переривати ввід потрібної інформації або ж скасувати виконання команди. Деякі команди підтримують аргументи командного рядка з прапорцями. Для деталей додайте прапорець <code>-h|--help</code> до команди (через пробіл). Даний прапорець має пріоритет над іншими, тому інші буде проігноровано. Щоб взаємодіяти зі мною, використовуйте такі команди: /start — показати доступні команди /help — показати цю підказку /get_current_user - показати ім'я поточного користувача /add_task — додати завдання /get_tasks — переглянути завдання /ch_lang — змінити мову відображення для чату /update_status — оновити статус завдання /stop — зупинити поточну команду

# table_cell_name
source: Name
uk: Назва

# table_cell_deadline
source: Deadline
uk: Дедлайн

# table_cell_description
source: Description
uk: Опис

# table_cell_status
source: Status
uk: Статус

source: In table view:
uk: У вигляді таблиці:

# wrng_val_enter_again
source: An invalid value was entered. Please try again
uk: Введено невірне значення. Спробуйте ще раз

# comm_succ_int
source: Command successfully interrupted
uk: Команда успішно перервана

# enter_task_desc
source: Enter task description
uk: Введіть опис завдання

# enter_task_deadline
source: Enter the task deadline in the format `dd.MM.yyyy HH:mm` or `dd.MM.yyyy`
uk: Введіть дедлайн завдання у форматі `dd.MM.yyyy HH:mm` або `dd.MM.yyyy`

# word_example
source: Example
uk: Приклад

# wrong_datetime_try_again
source: The date and time are incorrect. Please try again
uk: Неправильно введені дата та час. Спробуйте ще раз

# err_creat_task_try_again
source: An error occurred while creating a task. Please try again
uk: Трапилась помилка під час створення завдання. Спробуйте ще раз заново

# task_created
source: The task was successfully created
uk: Задачу було успішно створено

# usage
source: <b>Usage</b> /start — show available commands /help — show help /get_current_user — show the name of the current user /add_task — add a task /get_tasks — view tasks /ch_lang — change the display language for the chat /update_status — update task status
uk: <b>Використання</b> /start — показати доступні команди /help — показати підказку /get_current_user - показати ім'я поточного користувача /add_task — додати завдання /get_tasks — переглянути завдання /ch_lang — змінити мову відображення для чату /update_status — оновити статус завдання

source: No tasks
uk: Немає завдань

# word_by
source: By
uk: До

# word_status
source: Status
uk: Статус

# word_personal
source: Personal
uk: Особисті

# to_int_enter
source: To interrupt the command, write /stop
uk: Щоб перервати виконання команди, напишіть /stop

# need_enter_lang_code
source: You need to enter the language code
uk: Потрібно ввести код мови

# enter_lang_code
source: Enter the language code. Available codes:
uk: Введіть код мови. Доступні коди:

# choose_lang
source: Choose language
uk: Виберіть мову

source: Enter task name
uk: Введіть назву завдання

# need_enter_task_name
source: You need to enter task name
uk: Потрібно ввести назву задачі

# only_for_admins
source: The command is allowed only for group administrators
uk: Команда дозволена тільки для адміністраторів групи

# NotLevelWeek
source: Tasks with a deadline in week
uk: Завдання, дедлайн яких спливає через тиждень

# NotLevelTwoDays
source: Tasks with a deadline in two days
uk: Завдання, дедлайн яких спливає через два дні

# NotLevelDay
source: Tasks with a deadline in one day
uk: Завдання, дедлайн яких спливає через одинь день

# deadline_notification_reminder
source: Reminder of upcoming deadlines
uk: Нагадування про дедлайни, що спливають

# word_group
source: Group
uk: Група

# TaskNotStarted
source: Not started
uk: Не розпочато

# TaskInProgress
source: In progress
uk: В процесі

# TaskAlmostDone
source: Almost done
uk: Майже готово

# TaskCompleted
source: Completed
uk: Виконано

# TaskDeadlineMissed
source: Deadline missed
uk: Пропущено дедлайн

# TaskCompletedWithMissedDeadline
source: Completed with missed deadline
uk: Виконано з пропущеним дедлайном

# word_all
source: All
uk: Усі

# choose_status
source: Select the desired status
uk: Виберіть потрібний статус

# choose_chat_or_params
source: Choose from which chat to show tasks or choose an option
uk: Виберіть з якого чату показати завдання або виберіть параметр

# only_in_private
source: The action is allowed only in private messages with the bot
uk: Дія дозволена тільки у приватних повідомленнях з ботом

# enter_partial_task_id
source: Enter the task ID
uk: Введіть ID завдання

# enter_partial_task_title
source: Enter the name of the task (can be partial)
uk: Введіть назву завдання (можна частково)

# enter_new_task_status
source: Enter a new task status
uk: Введіть новий статус завдання

# err_update_task_status_try_again
source: Error updating the task status. Please try again
uk: Помилка оновлення статусу завдання. Спробуйте ще раз

# incorrect_task_status_try_again
source: Incorrect task status value. Please try again
uk: Невірне значення статусу завдання. Спробуйте ще раз

# task_status_updated
source: Task status has been successfully updated
uk: Статус завдання успішно оновлено

# need_enter_partial_task_id
source: You need to enter the task ID
uk: Потрібно ввести ID завдання

# HelpAddTask
source: Help with the /add_task command Available arguments: <code> -t|--title</code> — enter the title of the task <code>--des|--description</code> — enter a description of the task <code> --dl|--deadline</code> — enter the deadline of the task. The deadline must be in the format <code>dd.MM.yyyy HH:mm</code> or <code>dd.MM.yyyy</code> If one argument is specified, all others must be specified. Each argument must be followed by the corresponding value. The command can also be called without arguments, in which case the user will be prompted to enter the required values interactively. To interrupt the command in this mode, you can enter /stop
uk: Допомога по команді /add_task Доступні аргументи: <code> -t|--title</code> — ввести назву завдання <code>--des|--description</code> — ввести опис задвання <code> --dl|--deadline</code> — ввести дедлайн завдання. Дедлайн повинен бути у форматі <code>dd.MM.yyyy HH:mm</code> або <code>dd.MM.yyyy</code> Якщо вказаний один аргумент, повинні буде вказані і всі інші. Після кожного аргументу обов'язково повинно йти відповідне значення. Також команда може викликатись без аргументів, тоді користувачу буде запропоновано ввмести потрібні значення в інтерактивному режимі. Щоб перервати виконання команди в цьому режимі, можна ввести /stop

# HelpGetTasks
source: Help with the /get_tasks command Available arguments: <code>--dt|--drawtable</code> — display tasks in a table form You do not need to write anything after the argument, it is just a flag. The behavior of the bot when executing a command in groups and a private conversation with the bot is different: — in a group, the bot will only show tasks from that group; — in a private conversation, a built-in keyboard will appear, which will allow you to select a group from which to show tasks, choose a display mode, and filter tasks by their status
uk: Допомога по команді /get_tasks Доступні аргументи: <code>--dt|--drawtable</code> — вивести завдання в табличному вигляді Після аргументу нічого писати не потрібно, це просто прапор. Поведінки бота під час виконання комадни в групах і приватній розмові з ботом відрізняється: — в групі бот лише покаже завдання з цієї групи; — в приватній розмові з'явиться вбудована клавіатура, за допомогою якої можна буде обрати групу, з якої показати завдання, вибрати режим відображення та відфільтрувати завдання за їх статусом

# HelpChangeLanguage
source: Help with the /ch_lang command ❗️Only group administrators can change the language of a group Available arguments: <code>-l|--language</code> — enter the language code The argument must be followed by the code of the available language. The command can also be called without arguments, in which case the user will be prompted to enter the required code interactively. To interrupt the command in this mode, you can enter /stop
uk: Допомога по команді /ch_lang ❗️Змінювати мову групи можуть тільки її адміністратори Доступні аргументи: <code>-l|--language</code> — ввести код мови Після аргументу обов'язково повинен йти код доступної мови. Також команда може викликатись без аргументів, тоді користувачу буде запропоновано ввмести потрібий код в інтерактивному режимі. Щоб перервати виконання команди в цьому режимі, можна ввести /stop

# HelpUpdateTaskStatus
source: Help with the /update_status command ❗️The command works only in a private conversation with the bot Available arguments: <code>-i|--id</code> — task number/id <code>-t|--title</code> — task name (can be partial) <code>-s|--status</code> — new task status (code) If one argument is specified, all others must be specified. Each argument must be followed by the corresponding value. The command can also be called without arguments, in which case the user will be prompted to enter the required values interactively. To interrupt the command in this mode, you can enter /stop
uk: Допомога по команді /update_status ❗️Команда працює лише в приватній розмові з ботом Доступні аргументи: <code>-i|--id</code> — номер/id завдання <code>-t|--title</code> — назва завдання (можна частвово) <code>-s|--status</code> — новий статус завдання (код) Якщо вказаний один аргумент, повинні буде вказані і всі інші. Після кожного аргументу обов'язково повинно йти відповідне значення. Також команда може викликатись без аргументів, тоді користувачу буде запропоновано ввмести потрібні значення в інтерактивному режимі. Щоб перервати виконання команди в цьому режимі, можна ввести /stop
